const year = prompt('Привіт, чуваче. Якого ти року народження?');
const city = prompt('А в якому місті живеш?');
const sport = prompt('А яким спортом займаєшься?');

const message = alert("Раз я дізнався про тебе інформацію, то...");

if (year === null || year === "") {
    alert('Ох ти і жлоб, навіть рік народження не сказав')
} else {
    alert(`Я знаю, що ти ${year} року народження`);
}


if (city === null || city === "") {
    alert("А місто вказувати я буду чи хто? Оновив сторінку швиденько і дав мені конкретну відповідь")
} else {
    switch (city) {
        case "Київ":
            alert(`Проживаєш в столиці України`);
            break;
        case "Вашингтон ":
            alert(`Проживаєш в столиці США`);
            break;
        case "Лондон":
            alert(`Проживаєш в столиці Великобританії`);
            break;
        case "Брюссель":
            alert(`Проживаєш в столиці Бельгії`);
            break;
        case "Будапешт":
            alert(`Проживаєш в столиці Угорщини`);
            break;

        default:
            alert(`Якщо ти вказав столицю, яку я не знаю, то нічим допомогти не можу. У багатих людей свої причуди, а якщо вказав місто, то ти проживаєш в місті ${city}, якщо вказав не Дніпро, то по факту - ти в місті Дніпро`);
    }
}
if (sport === null | sport === "") {
    alert("Спорт - твій ворог, тому ти його і не вказав")
} else {
    alert(`Твій спорт - ${sport}. Ох ти ж і спортсмен. Рекомендую баночку холодного пивка`)
}